abdelmoulaelyazidi23/Secure-Sensor-Data-AES-STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include <stdio.h>
#include <string.h>
#include "stm32l4xx_hal_rng.h"
#include "aes.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define HTS221_ADDR    (0x5F << 1)
#define WHO_AM_I_REG   0x0F
#define CTRL_REG1      0x20
#define TEMP_OUT_L     0x2A
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c2;

QSPI_HandleTypeDef hqspi;

SPI_HandleTypeDef hspi3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_I2C2_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SPI3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
float T0, T1;
int16_t T0_out, T1_out;

uint8_t HTS221_ReadReg(uint8_t reg) {
	uint8_t data;
	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR, reg, I2C_MEMADD_SIZE_8BIT, &data, 1,
	HAL_MAX_DELAY);
	return data;
}

void HTS221_WriteReg(uint8_t reg, uint8_t value) {
	HAL_I2C_Mem_Write(&hi2c2, HTS221_ADDR, reg, I2C_MEMADD_SIZE_8BIT, &value, 1,
	HAL_MAX_DELAY);
}

float HTS221_ReadTemperature(void)
{
    uint8_t buf[2];
    int16_t T_out;

    HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR,
                     TEMP_OUT_L | 0x80,
                     I2C_MEMADD_SIZE_8BIT,
                     buf, 2, HAL_MAX_DELAY);

    T_out = (int16_t)(buf[0] | (buf[1] << 8));

    return ((float)(T_out - T0_out)) * (T1 - T0) / (float)(T1_out - T0_out) + T0;
}
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

	/* USER CODE BEGIN 1 */
	// --- AES software setup ---
	uint8_t AES_Key[16] = {
	    0x00, 0x7E, 0x15, 0x16,
	    0x28, 0xAE, 0xD2, 0xA6,
	    0xAB, 0xF7, 0x15, 0x88,
	    0x09, 0xCF, 0x4F, 0x3C
	};
	uint8_t RoundKeys[44][4] = {0};

	GenerateKeys(AES_Key, RoundKeys);
	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* Configure the peripherals common clocks */
	PeriphCommonClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_ADC1_Init();
	MX_DFSDM1_Init();
	MX_I2C2_Init();
	MX_QUADSPI_Init();
	MX_SPI3_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_USART3_UART_Init();
	MX_USB_OTG_FS_PCD_Init();
	/* USER CODE BEGIN 2 */
	uint8_t buf[2];
	uint8_t T0_degC_x8, T1_degC_x8, T1_T0_msb;

	// Lire calibration
	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR, 0x32, I2C_MEMADD_SIZE_8BIT, &T0_degC_x8, 1, HAL_MAX_DELAY);
	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR, 0x33, I2C_MEMADD_SIZE_8BIT, &T1_degC_x8, 1, HAL_MAX_DELAY);
	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR, 0x35, I2C_MEMADD_SIZE_8BIT, &T1_T0_msb, 1, HAL_MAX_DELAY);

	uint16_t T0_x8 = ((uint16_t)(T1_T0_msb & 0x03) << 8) | T0_degC_x8;
	uint16_t T1_x8 = ((uint16_t)(T1_T0_msb & 0x0C) << 6) | T1_degC_x8;

	T0 = T0_x8 / 8.0f;
	T1 = T1_x8 / 8.0f;

	// Lire sorties calibration
	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR,
	                 0x3C | 0x80,
	                 I2C_MEMADD_SIZE_8BIT,
	                 buf, 2, HAL_MAX_DELAY);
	T0_out = (int16_t)(buf[0] | (buf[1] << 8));

	HAL_I2C_Mem_Read(&hi2c2, HTS221_ADDR,
	                 0x3E | 0x80,
	                 I2C_MEMADD_SIZE_8BIT,
	                 buf, 2, HAL_MAX_DELAY);
	T1_out = (int16_t)(buf[0] | (buf[1] << 8));

	uint8_t id;
	char msg[40];

	id = HTS221_ReadReg(WHO_AM_I_REG);

	sprintf(msg, "WHO_AM_I = 0x%X\r\n", id);
	HAL_UART_Transmit(&huart1, (uint8_t*) msg, strlen(msg), HAL_MAX_DELAY);

	if (id == 0xBC) {
		HTS221_WriteReg(CTRL_REG1, 0x85); // Power ON + ODR = 1 Hz
		HAL_UART_Transmit(&huart1, (uint8_t*) "HTS221 OK\r\n", 11,
		HAL_MAX_DELAY);
	} else {
		HAL_UART_Transmit(&huart1, (uint8_t*) "HTS221 ERROR\r\n", 14,
		HAL_MAX_DELAY);
	}
	/* USER CODE END 2 */

